package practice;

//(public) class practice.Java2 {
// public -> 접근 제어자
public class Java2 {
    // 객체지향

    // 절차지향
    // 1. 자판기에 돈을 넣는다.
    // 2. 음료를 선택한다.
    // 3. 음료를 받는다.
    // 4. 잔 돈을 준다.
    // 시간 순으로 프로그래밍

    // 객체지향
    // 1. 자판기와 손님 객체를 만든다.
    // 2. 손님이 자판기에 돈을 넣는다.
    // 3. 자판기가 돈을 받는다.
    // 4. 손님이 원하는 음료를 선택한다.
    // 5. 자판기는 음료를 준다.
    // 6. 손님이 음료를 받는다.
    // 7. 자판기는 계산해서 잔 돈이 발생하면 거슬러 준다.
    // 8. 손님은 잔 돈을 받는다.
    // 객체간의 협력으로 프로그래밍

    // 클래스 : 객체를 만드는 설계, 객체의 속성과 기능들이 정의 되어 있다.
    // 객체 : 클래스로 만들어진 것.



}
